
// Define geographical regions and their prefectures
export const REGIONS_AND_PREFECTURES: Record<string, string[]> = {
  "Αττική": ["Νομός Αττικής"],
  "Κεντρική Ελλάδα": ["Νομός Βοιωτίας", "Νομός Ευβοίας", "Νομός Ευρυτανίας", "Νομός Φθιώτιδας", "Νομός Φωκίδας"],
  "Κεντρική Μακεδονία": ["Νομός Ημαθίας", "Νομός Θεσσαλονίκης", "Νομός Κιλκίς", "Νομός Πέλλας", "Νομός Πιερίας", "Νομός Σερρών", "Νομός Χαλκιδικής"],
  "Κρήτη": ["Νομός Ηρακλείου", "Νομός Λασιθίου", "Νομός Ρεθύμνου", "Νομός Χανίων"],
  "Ανατολική Μακεδονία και Θράκη": ["Νομός Δράμας", "Νομός Έβρου", "Νομός Καβάλας", "Νομός Ξάνθης", "Νομός Ροδόπης"],
  "Ήπειρος": ["Νομός Άρτας", "Νομός Ιωαννίνων", "Νομός Πρέβεζας", "Νομός Θεσπρωτίας"],
  "Ιόνια Νησιά": ["Νομός Ζακύνθου", "Νομός Κέρκυρας", "Νομός Κεφαλληνίας", "Νομός Λευκάδας"],
  "Βόρειο Αιγαίο": ["Νομός Λέσβου", "Νομός Σάμου", "Νομός Χίου"],
  "Πελοπόννησος": ["Νομός Αργολίδας", "Νομός Αρκαδίας", "Νομός Κορινθίας", "Νομός Λακωνίας", "Νομός Μεσσηνίας"],
  "Νότιο Αιγαίο": ["Νομός Κυκλάδων", "Νομός Δωδεκανήσου"],
  "Θεσσαλία": ["Νομός Καρδίτσας", "Νομός Λαρίσης", "Νομός Μαγνησίας", "Νομός Τρικάλων"],
  "Δυτική Μακεδονία": ["Νομός Γρεβενών", "Νομός Καστοριάς", "Νομός Κοζάνης", "Νομός Φλώρινας"],
  "Δυτική Ελλάδα": ["Νομός Αιτωλοακαρνανίας", "Νομός Αχαΐας", "Νομός Ηλείας"]
};

// Available services
export const SERVICES = [
  "Βασικό πακέτο",
  "Αποτέφρωση",
  "Έκθεση σορού",
  "Μεταφορά",
  "Έξτρα στολισμός",
  "Φερετροθήκη",
  "Φαγητό",
  "Μουσική"
];
